// JZ64 滑动窗口的最大值 堆 双指针 较难
// 描述
// 给定一个数组和滑动窗口的大小，找出所有滑动窗口里数值的最大值。例如，如果输入数组{2,3,4,2,6,2,5,1}及滑动窗口的大小3，那么一共存在6个滑动窗口，他们的最大值分别为{4,4,6,6,6,5}； 针对数组{2,3,4,2,6,2,5,1}的滑动窗口有以下6个： {[2,3,4],2,6,2,5,1}， {2,[3,4,2],6,2,5,1}， {2,3,[4,2,6],2,5,1}， {2,3,4,[2,6,2],5,1}， {2,3,4,2,[6,2,5],1}， {2,3,4,2,6,[2,5,1]}。
// 窗口大于数组长度的时候，返回空
// 示例1
// 输入：
// [2,3,4,2,6,2,5,1],3
// 返回值：
// [4,4,6,6,6,5]
function maxInWindows(num, size) {
  if (num.length < size || !size) return [];
  let res = [];
  for (let i = 0; i <= num.length - size; i++) {
    res.push(Math.max(...num.slice(i, i + size)));
  }
  return res;
}
